# DocumentPreviewSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentPreviewSettings Members
DocumentPreviewSettings Class Methods Properties See Also
---
The DocumentPreviewSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the DocumentPreviewSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| ForceViewUpdate | Sets Revit to update the preview view if necessary. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsViewIdValidForPreview | Identifies if the view id is valid as a preview view id. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| IsViewUpdateForced | Identifies if Revit will update the preview view if necessary. |
| PreviewViewId | The view id that will be used to generate the preview. |

# See Also
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace